---
type: AnalysisDisplayLegendSettings
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 17
tags: [revit-api, class]
---

# AnalysisDisplayLegendSettings

`Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings` · Revit 2024 · 17 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | AnalysisDisplayLegendSettings | — | `` |
| Constructor | AnalysisDisplayLegendSettings | 2011 | `public AnalysisDisplayLegendSettings ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | IsEqual | 2011 | `public bool IsEqual ( AnalysisDisplayLegendSettings other )` |
| Property | ColorRangeHeight | 2012 | `public int ColorRangeHeight { get ; set ; }` |
| Property | ColorRangeWidth | 2012 | `public int ColorRangeWidth { get ; set ; }` |
| Property | HeadingTextTypeId | 2011 | `public ElementId HeadingTextTypeId { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | NumberForScale | 2012 | `public double NumberForScale { get ; set ; }` |
| Property | NumberOfSteps | 2011 | `public int NumberOfSteps { get ; set ; }` |
| Property | Rounding | 2011 | `public double Rounding { get ; set ; }` |
| Property | ScaleHeight | 2012 | `public int ScaleHeight { get ; set ; }` |
| Property | ShowDataDescription | 2011 | `public bool ShowDataDescription { get ; set ; }` |
| Property | ShowDataName | 2011 | `public bool ShowDataName { get ; set ; }` |
| Property | ShowLegend | 2011 | `public bool ShowLegend { get ; set ; }` |
| Property | ShowUnits | 2011 | `public bool ShowUnits { get ; set ; }` |
| Property | TextTypeId | 2011 | `public ElementId TextTypeId { get ; set ; }` |